/*
N - долгота 55,755831
E - широта 37,617673
*/;

/*
	N			E
55,755831°, 37,617673° — градусы
N55.755831°, E37.617673° — градусы (+ доп. буквы)
55°45.35′N, 37°37.06′E — градусы и минуты (+ доп. буквы)
55°45′20.9916″N, 37°37′3.6228″E — градусы, минуты и секунды (+ доп. буквы)
При необходимости форматы можно пересчитать самостоятельно: 1° = 60′ (минутам), 1′ (минута) = 60″ (секундам). 
55,755831=55+(0.755831*60)=55°+45′+(0.34986*60)=55°45′20.9916″
55°45′20.9916″ =55°+45′+(20.9916/60)=55°+(45.34986/60)=55,755831
*/;




select *,6371 * 2 * ASIN(SQRT(
      POWER(SIN((lat - ABS(N)) * PI()/180 / 2), 2) +
      COS(lat * PI()/180) *
      COS(ABS(N) * PI()/180) *
      POWER(SIN((lon - E) * PI()/180 / 2), 2)
    )) as distance from all_city_id
    order by distance
    ;
